import csv

from selenium import webdriver
from selenium.webdriver.common.by import By
import time
words = """1.第三方支付
2. 网上支付
3. 在线支付
4. 移动支付
5. 电脑支付
6. NFC支付
7. 网联
8. 数字货币
9.网上融资
10. 网上投资
11. 网络融资
12. 网络投资
13. 网贷
14. 股权众筹融资
15.  量化金融
16. 智能投顾
17. 互联网理财
18. 互联网保险
19. 网络理财
20. 在线理财
21. 网上车险
22. 互联网金融
23.  智能金融合约
24.  征信
25. 网上银行
26. 电子银行
27. 在线银行
28. 网络银行
29. 网银
30. 开放银行
31. 手机银行
32. 移动银行""".split('\n')
words = [i.split('.')[1].strip() for i in words]
print(words)
citys = """1.北京市
2.天津市
3.上海市
4.重庆市
5.阿坝藏族羌族自治州
6.阿克苏地区
7.阿拉善盟
8.阿勒泰地区
9.阿里地区
10.安康市
11.安庆市
12.安顺市
13.安阳市
14.鞍山市
15.巴彦淖尔市
16.巴音郭楞蒙古自治州
17.巴中市
18.白城市
19.白山市
20.白银市
21.百色市
22.蚌埠市
23.包头市
24.宝鸡市
25.保定市
26.保山市
27.北海市
28.本溪市
29.毕节地区
30.滨州市
31.博尔塔拉蒙古自治州
32.沧州市
33.昌都地区
34.昌吉回族自治州
35.长春市
36.长沙市
37.长治市
38.常德市
39.常州市
40.巢湖市
41.朝阳市
42.潮州市
43.郴州市
44.成都市
45.承德市
46.池州市
47.赤峰市
48.崇左市
49.滁州市
50.楚雄彝族自治州
51.达州市
52.大理白族自治州
53.大连市
54.大庆市
55.大同市
56.大兴安岭地区
57.丹东市
58.德宏傣族景颇族自治州
59.德阳市
60.德州市
61.迪庆藏族自治州
62.定西市
63.东莞市
64.东营市
65.鄂尔多斯市
66.鄂州市
67.恩施土家族苗族自治州
68.防城港市
69.佛山市
70.福州市
71.抚顺市
72.抚州市
73.阜新市
74.阜阳市
75.甘南州
76.甘孜藏族自治州
77.赣州市
78.固原市
79.广安市
80.广元市
81.广州市
82.贵港市
83.贵阳市
84.桂林市
85.果洛藏族自治州
86.哈尔滨市
87.哈密地区
88.海北藏族自治州
89.海东地区
90.海口市
91.海南藏族自治州
92.海西蒙古族藏族自治州
93.邯郸市
94.汉中市
95.杭州市
96.毫州市
97.合肥市
98.和田地区
99.河池市
100.河源市
101.菏泽市
102.贺州市
103.鹤壁市
104.鹤岗市
105.黑河市
106.衡水市
107.衡阳市
108.红河哈尼族彝族自治州
109.呼和浩特市
110.呼伦贝尔市
111.湖州市
112.葫芦岛市
113.怀化市
114.淮安市
115.淮北市
116.淮南市
117.黄冈市
118.黄南藏族自治州
119.黄山市
120.黄石市
121.惠州市
122.鸡西市
123.吉安市
124.吉林市
125.济南市
126.济宁市
127.佳木斯市
128.嘉兴市
129.嘉峪关市
130.江门市
131.焦作市
132.揭阳市
133.金昌市
134.金华市
135.锦州市
136.晋城市
137.晋中市
138.荆门市
139.荆州市
140.景德镇市
141.九江市
142.酒泉市
143.喀什地区
144.开封市
145.克拉玛依市
146.克孜勒苏柯尔克孜自治州
147.昆明市
148.拉萨市
149.来宾市
150.莱芜市
151.兰州市
152.廊坊市
153.乐山市
154.丽江市
155.丽水市
156.连云港市
157.凉山彝族自治州
158.辽阳市
159.辽源市
160.聊城市
161.林芝地区
162.临沧市
163.临汾市
164.临夏州
165.临沂市
166.柳州市
167.六安市
168.六盘水市
169.龙岩市
170.陇南市
171.娄底市
172.泸州市
173.吕梁市
174.洛阳市
175.漯河市
176.马鞍山市
177.茂名市
178.眉山市
179.梅州市
180.绵阳市
181.牡丹江市
182.内江市
183.那曲地区
184.南昌市
185.南充市
186.南京市
187.南宁市
188.南平市
189.南通市
190.南阳市
191.宁波市
192.宁德市
193.怒江傈僳族自治州
194.攀枝花市
195.盘锦市
196.平顶山市
197.平凉市
198.萍乡市
199.莆田市
200.濮阳市
201.普洱市
202.七台河市
203.齐齐哈尔市
204.黔东南苗族侗族自治州
205.黔南布依族苗族自治州
206.黔西南布依族苗族自治州
207.钦州市
208.秦皇岛市
209.青岛市
210.清远市
211.庆阳市
212.曲靖市
213.衢州市
214.泉州市
215.日喀则地区
216.日照市
217.三门峡市
218.三明市
219.三亚市
220.山南地区
221.汕头市
222.汕尾市
223.商洛市
224.商丘市
225.上饶市
226.韶关市
227.邵阳市
228.绍兴市
229.深圳市
230.沈阳市
231.十堰市
232.石家庄市
233.石嘴山市
234.双鸭山市
235.朔州市
236.四平市
237.松原市
238.苏州市
239.宿迁市
240.宿州市
241.绥化市
242.随州市
243.遂宁市
244.塔城地区
245.台州市
246.太原市
247.泰安市
248.泰州市
249.唐山市
250.天水市
251.铁岭市
252.通化市
253.通辽市
254.铜川市
255.铜陵市
256.铜仁市
257.吐鲁番地区
258.威海市
259.潍坊市
260.渭南市
261.温州市
262.文山壮族苗族自治州
263.乌海市
264.乌兰察布市
265.乌鲁木齐市
266.无锡市
267.吴忠市
268.芜湖市
269.梧州市
270.武汉市
271.武威市
272.西安市
273.西宁市
274.西双版纳傣族自治州
275.锡林郭勒盟
276.厦门市
277.咸宁市
278.咸阳市
279.湘潭市
280.湘西土家族苗族自治州
281.襄樊市
282.孝感市
283.忻州市
284.新乡市
285.新余市
286.信阳市
287.兴安盟
288.邢台市
289.徐州市
290.许昌市
291.宣城市
292.雅安市
293.烟台市
294.延安市
295.延边朝鲜族自治州
296.盐城市
297.扬州市
298.阳江市
299.阳泉市
300.伊春市
301.伊犁哈萨克自治州
302.宜宾市
303.宜昌市
304.宜春市
305.益阳市
306.银川市
307.鹰潭市
308.营口市
309.永州市
310.榆林市
311.玉林市
312.玉树藏族自治州
313.玉溪市
314.岳阳市
315.云浮市
316.运城市
317.枣庄市
318.湛江市
319.张家界市
320.张家口市
321.张掖市
322.漳州市
323.昭通市
324.肇庆市
325.镇江市
326.郑州市
327.中山市
328.中卫市
329.舟山市
330.周口市
331.株洲市
332.珠海市
333.驻马店市
334.资阳市
335.淄博市
336.自贡市
337.遵义市""".split('\n')
citys = [i.split('.')[1].strip() for i in citys][:10]
print(citys)
import _thread
xpage = [i for i in range(2010, 2023)]
flagaa = 0
chrome_options = webdriver.ChromeOptions()
prefs = {'profile.managed_default_content_settings.images': 2}
chrome_options.add_experimental_option('prefs',prefs)
# chrome_options.add_argument('--headless')
ress = []
def get_all(xpage):
    global flagaa
    i = 0
    j = 0
    y = xpage
    while i < len(words):
        while j < len(citys):
            try:
                driver = webdriver.Chrome(chrome_options=chrome_options)
                driver.get(f'https://www.baidu.com/s?wd=' + citys[j] + words[i])

                time.sleep(1)
                driver.find_element(by=By.XPATH,value='//*[@id="tsn_inner"]/div[2]/div').click()
                time.sleep(1)
                driver.find_element(by=By.XPATH,value='//*[@id="timeRlt"]').click()
                time.sleep(1)
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[2]/div[1]/input').clear()
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[2]/div[1]/input').send_keys(str(y) + '-01-01')
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[2]/div[1]/input').click()
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[3]/div[1]/input').clear()
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[3]/div[1]/input').send_keys(str(y) + '-12-31')
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[3]/div[1]/input').click()
                driver.find_element(by=By.XPATH,value='//*[@id="container"]/div[2]/div/div[2]/div[2]/div[4]/button').click()
                time.sleep(1)
                content = driver.page_source
                n = content.split('百度为您找到相关结果')[1].split('个')[0]
                print(citys[j],words[i],y,n)
                ress.append([citys[j],words[i],y,n])
                j += 1
            except:
                continue
        i += 1
    flagaa += 1
for i in range(len(xpage)):
    _thread.start_new_thread(get_all, (xpage[i],))
while 1:
    time.sleep(1)
    if flagaa == 10:
       break
with open('res.csv','w',newline='') as f:
    f_csv = csv.writer(f)
    f_csv.writerows(ress)